Tekla Open API Reference for Tekla Structures 2025
MainWindow Methods
The MainWindow type exposes the following members.
Methods
Name | Description
AddExternalWindow
 Registers the entire dialog to be insensitive at certain points, for example while modal Tekla Structures system dialog boxes are open. When insensitive, the dialog does not respond to any input. You can remove the registration of the dialog with RemoveExternalWindow(String, IntPtr).
RemoveExternalWindow
 Removes a registration done with AddExternalWindow(String, IntPtr).
Top
See Also
Reference
MainWindow Class
Tekla.Structures.Dialog Namespace